cpp/20230816T220817--types__cpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Types</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Types</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga9c84f3">Introduction</a></li>
<li><a href="#org284a97a">Important Types</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga9c84f3" class="outline-2">
<h2 id="orga9c84f3">Introduction</h2>
<div class="outline-text-2" id="text-orga9c84f3">
<p>
The places in which we store data are called <i>objects</i>. To access an
object we need a <i>name</i>. A named object is called a <i>variable</i> and
has a specific <b>type</b> (such as <code>int</code> and <code>string</code>).
</p>

<p>
The <b>type</b> determines what can be put into the object and which
operations can be applied. Each of the type have their own
characteristic style of  <a href="20230816T224346--literals__cpp.html">literals</a>.
</p>

<p>
For example, 
</p>
<ul class="org-ul">
<li><code>123</code> is an integer. We can perform multiplicaiton using <code>*</code> operator
on integers.</li>
<li><code>"Hello, World!\n"</code> is a string and we can use <code>&lt;=</code> to compare them.</li>
</ul>
</div>
</div>

<div id="outline-container-org284a97a" class="outline-2">
<h2 id="org284a97a">Important Types</h2>
<div class="outline-text-2" id="text-org284a97a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type name</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Comments / Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">int</td>
<td class="org-left">123, 2, -1, -4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">char</td>
<td class="org-left">'2', 'o', 'e'</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">std::string</td>
<td class="org-left">"Hello world"</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">3.5, 2.0, 3.1415</td>
<td class="org-left">Double bit floating point precision.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Represents real numbers in computers.</td>
</tr>

<tr>
<td class="org-left">bool</td>
<td class="org-left">true, false</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-08-16 Wed 22:08</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
